// Data types (자료형)

/* 문자 자료형 */

// [char] ... [1 byte] ... [-128 ~ -127 or 0 ~ 255]
// [unsigned char] ... [1 byte] ... [0 ~ 255]
// [signed char] ... [1 byte] ... [-128 ~ -127]


/* 정수 자료형 */

// [int] ... [2 or 4 byte] ... [-32,768 ~ -32,767 or -2,147,483,648 ~ 2,147,483,647]
// [unsigned int] ... [2 or 4 byte] ... [0 ~ 65,535 or 0 ~ 4,294,967,295]

// [short] ... [2 byte] ... [-32,768 ~ -32,767]
// [unsigned short] ... [2 byte] ... [0 ~ 65,535]

// [long] ... [4 byte] ... [-2,147,483,648 ~ 2,147,483,647]
// [unsigned long] ... [4 byte] ... [0 ~ 4,294,967,295]


/* 실수 자료형 */

// [float] ... [4 byte] ... [1.2E^-38 ~ 3.4E^+38]
// [double] ... [4 byte] ... [2.3E^-308 ~ 1.7E^+308]
// [long double] ... [10 byte] ... [3.4E^-4932 ~ 1.1E^+4932]
